In [1]:
import pandas as pd
import numpy as np

In [2]:
data = pd.read_csv("k-Mean Clustering_data.csv")

In [3]:
data.head(20)

    CustomerID   Genre  Age  Annual Income (k$)  Spending Score (1-100)
0            1    Male   19                  15                      39
1            2    Male   21                  15                      81
2            3  Female   20                  16                       6
3            4  Female   23                  16                      77
4            5  Female   31                  17                      40
5            6  Female   22                  17                      76
6            7  Female   35                  18                       6
7            8  Female   23                  18                      94
8            9    Male   64                  19                       3
9           10  Female   30                  19                      72
10          11    Male   67                  19                      14
11          12  Female   35                  19                      99
12          13  Female   58                  20                      15
13          14  Female   24                  20                      77
14          15    Male   37                  20                      13
15          16    Male   22                  20                      79
16          17  Female   35                  21                      35
17          18    Male   20                  21                      66
18          19    Male   52                  23                      29
19          20  Female   35                  23                      98

In [5]:
x= data.iloc[:,3:5]
x.head()

   Annual Income (k$)  Spending Score (1-100)
0                  15                      39
1                  15                      81
2                  16                       6
3                  16                      77
4                  17                      40

In [6]:
x.head(2)

   Annual Income (k$)  Spending Score (1-100)
0                  15                      39
1                  15                      81

In [7]:
x1 = list(x["Annual Income (k$)"])
x2 = list(x["Spending Score (1-100)"])

In [8]:
len(x1) , len(x2)

(200, 200)

In [9]:
k1 = [x1[0] , x2[0]]
k2 = [x1[100] , x2[100]]
print(k1 , k2)

[15, 39] [62, 41]

In [10]:
def calculate_mean(x):
    
    m = []
    n = []
    
    for  i in x:
        m.append(i[0])
        n.append(i[1])
        return np.mean(m) , np.mean(n)

In [11]:

k = 0
l = 0
while(k<30):
    c1 = []
    c2 = []

    for i , j in zip(x1 , x2):
        d1 = ((k1[0]-i)**2 + (k1[1]-j)**2)**.5 
        d2 = ((k2[0]-i)**2 + (k2[1]-j)**2)**.5 
        l = l+1
        
        if(d1<d2):
            h = []
            h.append(i)
            h.append(j)
            c1.append(h)
            
        else:
            h = []
            h.append(i)
            h.append(j)
            c2.append(h)
        # call the mean
        C1mx, C1my = calculate_mean(c1)
        C2mx, C2my = calculate_mean(c1)        # calling calculate_mean with c1  data
        
    if (C1mx == k1[0]  and C1my == k1[1]):
        break
    else:
        k1[0]= C1mx
        k1[1]= C1my
        k2[0]= C2mx
        k2[1]= C2my
        k = k+1

In [12]:
print(c1)
print("\nlength of c1 is ", len(c1))

[[15, 39], [15, 81], [16, 6], [16, 77], [17, 40], [17, 76], [18, 6], [18, 94], [19, 3], [19, 72], [19, 14], [19, 99], [20, 15], [20, 77], [20, 13], [20, 79], [21, 35], [21, 66], [23, 29], [23, 98], [24, 35], [24, 73], [25, 5], [25, 73], [28, 14], [28, 82], [28, 32], [28, 61], [29, 31], [29, 87], [30, 4], [30, 73], [33, 4], [33, 92], [33, 14], [33, 81], [34, 17], [34, 73], [37, 26], [37, 75], [38, 35], [39, 28]]

length of c1 is  42

In [13]:
print(c2)
print("\nlength of c2 is ", len(c2))

[[38, 92], [39, 36], [39, 61], [39, 65], [40, 55], [40, 47], [40, 42], [40, 42], [42, 52], [42, 60], [43, 54], [43, 60], [43, 45], [43, 41], [44, 50], [44, 46], [46, 51], [46, 46], [46, 56], [46, 55], [47, 52], [47, 59], [48, 51], [48, 59], [48, 50], [48, 48], [48, 59], [48, 47], [49, 55], [49, 42], [50, 49], [50, 56], [54, 47], [54, 54], [54, 53], [54, 48], [54, 52], [54, 42], [54, 51], [54, 55], [54, 41], [54, 44], [54, 57], [54, 46], [57, 58], [57, 55], [58, 60], [58, 46], [59, 55], [59, 41], [60, 49], [60, 40], [60, 42], [60, 52], [60, 47], [60, 50], [61, 42], [61, 49], [62, 41], [62, 48], [62, 59], [62, 55], [62, 56], [62, 42], [63, 50], [63, 46], [63, 43], [63, 48], [63, 52], [63, 54], [64, 42], [64, 46], [65, 48], [65, 50], [65, 43], [65, 59], [67, 43], [67, 57], [67, 56], [67, 40], [69, 58], [69, 91], [70, 29], [70, 77], [71, 35], [71, 95], [71, 11], [71, 75], [71, 9], [71, 75], [72, 34], [72, 71], [73, 5], [73, 88], [73, 7], [73, 73], [74, 10], [74, 72], [75, 5], [75, 93], [76, 40], [76, 87], [77, 12], [77, 97], [77, 36], [77, 74], [78, 22], [78, 90], [78, 17], [78, 88], [78, 20], [78, 76], [78, 16], [78, 89], [78, 1], [78, 78], [78, 1], [78, 73], [79, 35], [79, 83], [81, 5], [81, 93], [85, 26], [85, 75], [86, 20], [86, 95], [87, 27], [87, 63], [87, 13], [87, 75], [87, 10], [87, 92], [88, 13], [88, 86], [88, 15], [88, 69], [93, 14], [93, 90], [97, 32], [97, 86], [98, 15], [98, 88], [99, 39], [99, 97], [101, 24], [101, 68], [103, 17], [103, 85], [103, 23], [103, 69], [113, 8], [113, 91], [120, 16], [120, 79], [126, 28], [126, 74], [137, 18], [137, 83]]

length of c2 is  158

In [14]:
k1          # mean if c1

[15, 39]

In [15]:
k2          # mean of c2

[62, 41]